/*
    Localizable.strings
    SkypeMac Share Extension
*/

/* Error when cannot find items to share */
ErrorTitle_NoItemsToShare = "No items to share";
ErrorMessage_NoItemsToShare = "Unable to find any shareable items.";

/* Error when trying to share a bundle */
ErrorTitle_CannotShareBundle = "Skype can’t share this item.";
ErrorMessage_CannotShareBundle = "You may only share single files (but not applications) on Skype.";

/* Error when trying to share an empty file */
ErrorTitle_CannotShareEmptyFile = "Skype can’t share this item.";
ErrorMessage_CannotShareEmptyFile = "The file is empty.";

/* Error when trying to share too big file */
ErrorTitle_CannotShareTooBigFile = "Skype can’t share this item.";
ErrorMessage_CannotShareTooBigFile = "The file is too large to be shared on Skype.";

/* Error when cannot connect to agent initially */
ErrorTitle_CannotConnectToAgent = "Unable to connect to Skype";
ErrorMessage_CannotConnectToAgent = "Sharing to Skype is currently unavailable, please try again later.";

/* Error when cannot connect to agent on sending */
ErrorTitle_SendingFailed = "Unable to share to Skype";
ErrorMessage_SendingFailed = "Sharing to Skype is currently unavailable, please try again later.";

/* Alert shown as sheet when message is too long */
AlertTitle_CannotSendTooBigMessage = "Skype can’t send this message.";
AlertMessage_CannotSendTooBigMessage = "This message is too long to send.";

/* Alert shown as sheet when too many recipients; arg1 = max number of recipients */
AlertTitle_TooManyRecipients = "Too many recipients";
AlertMessage_TooManyRecipients_Template = "You may only share to %lu recipients at any one time.";

/* Common button titles */
ButtonTitle_OK = "OK";
ButtonTitle_Cancel = "Cancel";

/* Chat location message legacy text when no address is available (shown only in legacy Skypes) */
ChatMessageLabel_Location = "Location";

/* used in custom paste operation */
MenuItemTitle_Paste = "Paste";

/* Recipients entry view placeholder */
RecipientsEntryView_Placeholder = "No recipients";

/* Text shown on first run when loading conversations, should not bee too long */
Label_LoadingConversations = "Loading conversations…";

/* Contact list group and contact icon VO labels */
ContactList_GroupImage_VoiceOverLabel = "group";
ContactList_ContactImage_VoiceOverLabel = "contact";

/* Contact list VO label */
ContactList_VoiceOverLabel = "contacts and groups";

/* Input view VO label */
Input_Message_Placeholder = "Type a message here";
